ORIENTATION_1/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    topFanInlets
    {
        type            calculated;
        value           uniform 1e-5;    // Adjust for viscosity
    }
    acInlets
    {
        type            calculated;
        value           uniform 1e-5;    // Adjust for viscosity
    }
    wallFanInlet1
    {
        type            calculated;
        value           uniform 1e-5;    // Adjust for viscosity
    }
    wallFanInlet2
    {
        type            calculated;
        value           uniform 1e-5;    // Adjust for viscosity
    }
}


// ************************************************************************* //
